blog/2010/06/30/solar-system-1_1_1-win-0_2-release/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>solar- system-1.1.1-win-0.2发布 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>solar- system-1.1.1-win-0.2发布</h1>
  <p>
在<a href="http://libears.com/">@libear</a>的测试、帮助下，发现了 solar-system-1.1.1-win-0.1的三个Bug，描述如下：
1.创建Public Symlink时，即使创建成功也会提示failed消息
2.如果进入script目录使用solar命令，那么将无法找到相应的Public目录
3.unlink目录提示无权限删除相应符号链接
</p>

<p>
Here, we are pleased to release the second version of solar-system-1.1.1-win. The three bugs mentioned above have been fixed. More information, Please read README2.
</p>

<p>
You can download it from here: <a href="http://solarphp.cn/download/solar-system-1.1.1-win-0.2.rar">http://solarphp.cn/download/solar-system-1.1.1-win-0.2.rar</a>
You can always download the latest version for solar-system-1.1.1-win here: <a href="http://solarphp.cn/download/solar-system-1.1.1-win-latest.rar">http://solarphp.cn/download/solar-system-1.1.1-win-latest.rar</a>
</p>

<p>
Enjoy~
</p>

<p>
<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> link public
@ /source/solar/Solar/Cli/LinkPublic.php [update]
</p>
<p>
you should alway use absolute path information here
</p>
<ul class="org-ul">
<li></li>
<li>add $system before relative path
</li>
</ul>
<hr  />
<p>
#line 101
wrong message tips,if exec("mklink tgt src") success, it returns
"symbolic link created for foo.php <a id="" name=""></a> bar.php"
</p>
<ul class="org-ul">
<li></li>
<li>change it to "complete".
</li>
</ul>

<p>
<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup> unlink vendor
@ /source/solar/Solar/Cli/UnlinkVendor.php [update]
</p>
<p>
on windows platform, you can only use unlink for files, not for directories.
</p>
<ul class="org-ul">
<li></li>
<li>make a conditon to judge resource type befor processing
</li>
</ul>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div>
</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
